import image from '../icons/postImage.png'
import { IPost } from '../types/IPosts'


export const posts: IPost[] = [
    {
        image: image,
        title: 'Опубликованы новые результаты миссии NASA DART',
        description: 'В прошлом году миссия DART столкнулась с астероидом Диморф и немного изменила его орбиту. Первые научные результаты этого...',
        id: 1,
        tags:
            [{ title: 'Космос', id: 1 }, { title: 'Астрономия', id: 2 }, { title: 'Наука', id: 3 }],
        created_at: '23 февраля 2023 года '
    },
    {
        image: image,
        title: 'Опубликованы новые результаты миссии NASA DART',
        description: 'В прошлом году миссия DART столкнулась с астероидом Диморф и немного изменила его орбиту. Первые научные результаты этого... Lorem4mpot43gniou4bgtt324ht43ihuhi32r',
        id: 11,
        tags: [{ title: 'Космос', id: 1 }, { title: 'Астрономия', id: 2 }, { title: 'Наука', id: 3 }],
        created_at: '23 февраля 2023 года '
    },
    {
        image: image,
        title: 'Опубликованы новые результаты миссии NASA DART',
        description: 'В прошлом году миссия DART столкнулась с астероидом Диморф и немного изменила его орбиту. Первые научные результаты этого...',
        id: 10,
        tags: [{ title: 'Космос', id: 1 }, { title: 'Астрономия', id: 2 }, { title: 'Наука', id: 3 }],
        created_at: '23 февраля 2023 года '
    },
    {
        image: image,
        title: 'Опубликованы новые результаты миссии NASA DART',
        description: 'В прошлом году миссия DART столкнулась с астероидом Диморф и немного изменила его орбиту. Первые научные результаты этого...',
        id: 9,
        tags: [{ title: 'Космос', id: 1 }, { title: 'Астрономия', id: 2 }, { title: 'Наука', id: 3 }],
        created_at: '23 февраля 2023 года '
    },
    {
        image: image,
        title: 'Опубликованы новые результаты миссии NASA DART',
        description: 'В прошлом году миссия DART столкнулась с астероидом Диморф и немного изменила его орбиту. Первые научные результаты этого...',
        id: 8,
        tags: [{ title: 'Космос', id: 1 }, { title: 'Астрономия', id: 2 }, { title: 'Наука', id: 3 }],
        created_at: '23 февраля 2023 года '
    },
    {
        image: image,
        title: 'Опубликованы новые результаты миссии NASA DART',
        description: 'В прошлом году миссия DART столкнулась с астероидом Диморф и немного изменила его орбиту. Первые научные результаты этого...',
        id: 7,
        tags: [{ title: 'Космос', id: 1 }, { title: 'Астрономия', id: 2 }, { title: 'Наука', id: 3 }],
        created_at: '23 февраля 2023 года '
    },
    {
        image: image,
        title: 'Опубликованы новые результаты миссии NASA DART',
        description: 'В прошлом году миссия DART столкнулась с астероидом Диморф и немного изменила его орбиту. Первые научные результаты этого...',
        id: 6,
        tags: [{ title: 'Космос', id: 1 }, { title: 'Астрономия', id: 2 }, { title: 'Наука', id: 3 }],
        created_at: '23 февраля 2023 года '
    },
    {
        image: image,
        title: 'Опубликованы новые результаты миссии NASA DART',
        description: 'В прошлом году миссия DART столкнулась с астероидом Диморф и немного изменила его орбиту. Первые научные результаты этого...',
        id: 5,
        tags: [{ title: 'Космос', id: 1 }, { title: 'Астрономия', id: 2 }, { title: 'Наука', id: 3 }],
        created_at: '23 февраля 2023 года '
    },
    {
        image: image,
        title: 'Опубликованы новые результаты миссии NASA DART',
        description: 'В прошлом году миссия DART столкнулась с астероидом Диморф и немного изменила его орбиту. Первые научные результаты этого...',
        id: 4,
        tags: [{ title: 'Космос', id: 1 }, { title: 'Астрономия', id: 2 }, { title: 'Наука', id: 3 }],
        created_at: '23 февраля 2023 года '
    },
    {
        image: image,
        title: 'Опубликованы новые результаты миссии NASA DART',
        description: 'В прошлом году миссия DART столкнулась с астероидом Диморф и немного изменила его орбиту. Первые научные результаты этого...',
        id: 3,
        tags: [{ title: 'Космос', id: 1 }, { title: 'Астрономия', id: 2 }, { title: 'Наука', id: 3 }],
        created_at: '23 февраля 2023 года '
    },
    {
        image: image,
        title: 'Опубликованы новые результаты миссии NASA DART',
        description: 'В прошлом году миссия DART столкнулась с астероидом Диморф и немного изменила его орбиту. Первые научные результаты этого...',
        id: 2,
        tags: [{ title: 'Космос', id: 1 }, { title: 'Астрономия', id: 2 }, { title: 'Наука', id: 3 }],
        created_at: '23 февраля 2023 года '
    }
]